//
// Created by 李玉龙 on 2024/6/18.
//
#include "op_exp.h"
#include <stdio.h>

void operator() {
    //1.左移实现乘法
    //2.右移实现除法
    //3.交换两个整形的值
    //4.判断整数的奇偶
    //x&1
    //5.高低位的交换
    //a = (a >> 8) | (a << 8)

    //6.寄存器的置位，（8位寄存器，将a的第3个bit位置1，bit位最右边的位第0位）
    // a = a | 0x08  ====== a = a | (1 << 3)
    //将第三个bit位清零，其它位置保持不变
    // a = a & (~0x08) ==== a = a & (~(1 << 3))

    //7.数据的“拆解”
    int x = 0x12345678;

    printf("0x%0x\n", x & 0xFF);
    printf("0x%0x\n", (x >> 8) & 0xFF);
    printf("0x%0x\n", (x >> 16) & 0xFF);
    printf("0x%0x\n", (x >> 24) & 0xFF);

    //8.数据的组装
    //假如我们拿到了被拆解后的数据分别为：0x12 0x34 0x56 0x78， 如果组装成0x12345678呢？
    x = 0x12 << 24 | 0x34 << 16 | 0x56 << 8 | 0x78;

}

void expression() {

}
